#### ExternalResourceServiceUtils Members

---

|  |
| --- |
| ExternalResourceServiceUtils Class   Methods   See Also |

The  ExternalResourceServiceUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetServersByType | Gets registered external resource servers which support the external resource type. |

# See Also

ExternalResourceServiceUtils Class

Autodesk.Revit.DB Namespace